Seaborn EDAS:

univariantes:

histogramas y curvas de densidad
boxplot
countplot


bivariantes y multivariantes

scatterplot con hue, con size, con style
Calcular correlación con Pandas y mostrarla con seaborn


Combinarlas con filtros



Outliers: Visualización y filtrado


asimetría, curtosis y transformar datos con logaritmo o raíz cuadrada

### Importar librerias necesarias

In [4]:
import pandas as pd
import seaborn as sns

### Carga del CSV con Pandas

In [5]:
df_diamonds = pd.read_csv('../Data/diamonds.csv')
df_diamonds.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 53940 entries, 0 to 53939
Data columns (total 10 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   carat    53939 non-null  float64
 1   cut      53937 non-null  object
 2   color    53938 non-null  object
 3   clarity  53938 non-null  object
 4   depth    53940 non-null  float64
 5   table    53938 non-null  float64
 6   price    53938 non-null  object
 7   x        53938 non-null  object
 8   y        53939 non-null  float64
 9   z        53939 non-null  float64
dtypes: float64(5), object(5)
memory usage: 4.1+ MB

#### Informacón sobre el CSV

In [6]:
df_diamonds.describe()

              carat         depth         table             y             z
count  53939.000000  53940.000000  53938.000000  53939.000000  53939.000000
mean       0.797946     61.749405     57.457145      5.734479      3.538722
std        0.474013      1.432621      2.234521      1.142092      0.705700
min        0.200000     43.000000     43.000000      0.000000      0.000000
25%        0.400000     61.000000     56.000000      4.720000      2.910000
50%        0.700000     61.800000     57.000000      5.710000      3.530000
75%        1.040000     62.500000     59.000000      6.540000      4.040000
max        5.010000     79.000000     95.000000     58.900000     31.800000

In [7]:
df_diamonds.isna().sum()

carat      1
cut        3
color      2
clarity    2
depth      0
table      2
price      2
x          2
y          1
z          1
dtype: int64

#### Limpieza de nulos (limpiar valores NaN):
- Nulos en columnas continuas: mediana, media

In [14]:
# Columna Carat
media_carat = df_diamonds['carat'].mean()
print(f" La media de quilates es: {media_carat}")

 La media de quilates es: 0.7979463838780845

In [16]:
df_diamonds['carat'] = df_diamonds['carat'].fillna(media_carat)
df_diamonds['carat'].isna().sum()

np.int64(0)

In [26]:
# Columna Cut
moda_cut = df_diamonds['cut'].mode()[0]
print(f" La moda de corte es: {moda_cut}")

 La moda de corte es: Ideal

In [27]:
df_diamonds['cut'] = df_diamonds['cut'].fillna(moda_cut)
df_diamonds['cut'].isna().sum()

np.int64(0)

In [28]:
# Columna Color
mediana_color = df_diamonds['color'].mode()[0]
print(f" La mediana de color es: {mediana_color}")

 La mediana de color es: G

In [29]:
df_diamonds['color'] = df_diamonds['color'].fillna(mediana_color)
df_diamonds['color'].isna().sum()

np.int64(0)

In [32]:
# Columna Clarrity
mode_clarity = df_diamonds['clarity'].mode()[0]
print(f" La mediana de claridad es: {mode_clarity}")

 La mediana de claridad es: SI1

In [33]:
# Rrelleno tambien con un valor fijo tambien como pedia el enunciado
df_diamonds['clarity'] = df_diamonds['clarity'].fillna("Relleno")
df_diamonds['clarity'].isna().sum()

np.int64(0)

In [35]:
# Columna Table
mediana_table = df_diamonds['table'].median()
print(f" La mediana del plano superior es: {mediana_table}")

 La mediana del plano superior es: 57.0

In [36]:
df_diamonds['table'] = df_diamonds['table'].fillna(mediana_table)
df_diamonds['table'].isna().sum()

np.int64(0)

In [37]:
# Columna Price
mediana_price = df_diamonds['price'].median()
print(f" La mediana del plano superior es: {mediana_price}")

TypeError: Cannot convert ['326' '326' '327' ... '2757' '2757' '2757'] to numeric

In [ ]:
df_diamonds['price'] = df_diamonds['price'].fillna(mediana_price)
df_diamonds['price'].isna().sum()

- Nulos en columnas categóricas: moda, un valor fijo

In [13]:
df_diamonds['name'].isna().sum()

np.int64(1)

In [14]:
df_diamonds['name'] = df_diamonds['name'].fillna("Hueco Rellenado")

In [15]:
df_diamonds['3rd'].isna().sum()

np.int64(0)

#### Cambio de tipo de dato: .astype()

In [16]:
df_diamonds['world_champ'].isna().sum()

np.int64(88)

In [17]:
df_diamonds['world_champ'] = df_diamonds['world_champ'].fillna(0)

In [18]:
df_diamonds['world_champ'].isna().sum()

np.int64(0)

In [19]:
df_diamonds.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 115 entries, 0 to 114
Data columns (total 7 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   name         115 non-null    object
 1   victories    115 non-null    int64
 2   2nd          115 non-null    float64
 3   3rd          115 non-null    float64
 4   poles        54 non-null     float64
 5   fastest_lap  97 non-null     object
 6   world_champ  115 non-null    float64
dtypes: float64(4), int64(1), object(2)
memory usage: 6.4+ KB

In [20]:
df_diamonds["world_champ"] = df_diamonds["world_champ"].astype("int8")
df_diamonds.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 115 entries, 0 to 114
Data columns (total 7 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   name         115 non-null    object
 1   victories    115 non-null    int64
 2   2nd          115 non-null    float64
 3   3rd          115 non-null    float64
 4   poles        54 non-null     float64
 5   fastest_lap  97 non-null     object
 6   world_champ  115 non-null    int8
dtypes: float64(3), int64(1), int8(1), object(2)
memory usage: 5.6+ KB

#### Limpieza de valores error: 
- Llegue un valor incorrecto, por ejemplo una columna número le llega una interrogación

In [21]:
df_diamonds[df_diamonds.isin(["?"]).any(axis=1)]

          name  victories  2nd  3rd  poles fastest_lap  world_champ
47  HENNEN Pat          3  5.0  4.0    NaN           ?            0

In [22]:
df_diamonds["fastest_lap"] = df_diamonds["fastest_lap"].replace('?', 365)
df_diamonds[df_diamonds.isin([365]).any(axis=1)]

          name  victories  2nd  3rd  poles fastest_lap  world_champ
47  HENNEN Pat          3  5.0  4.0    NaN         365            0

#### Encoding: texto a numérico
- Uso de la función get_dummies() para encoding one_hot

In [23]:
df_diamonds_encoding = pd.read_csv('../Data/motogp_allriders.csv')

In [24]:
# Encoding a todo el dataframe
pd.get_dummies(df_diamonds_encoding)

,victories,2nd,3rd,poles,world_champ,name_ABE Norick,name_AGOSTINI Giacomo,name_AHEARN Jack,name_AMM Ray,name_ANDERSON Fergus,...,fastest_lap_46,fastest_lap_5,fastest_lap_57,fastest_lap_6,fastest_lap_69,fastest_lap_7,fastest_lap_76,fastest_lap_8,fastest_lap_9,fastest_lap_?
0,89,61.0,49.0,55.0,7.0,False,False,False,False,False,...,False,False,False,False,False,False,True,False,False,False
1,68,20.0,NaN,6.0,8.0,False,True,False,False,False,...,False,False,False,False,True,False,False,False,False,False
2,57,29.0,10.0,62.0,6.0,False,False,False,False,False,...,False,False,True,False,False,False,False,False,False,False
3,54,31.0,10.0,58.0,5.0,False,False,False,False,False,...,True,False,False,False,False,False,False,False,False,False
4,47,44.0,23.0,43.0,3.0,False,False,False,False,False,...,False,False,False,False,False,False,False,False,False,False
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
110,1,NaN,NaN,NaN,NaN,False,False,False,False,False,...,False,False,False,False,False,False,False,False,False,False
111,1,NaN,NaN,NaN,NaN,False,False,False,False,False,...,False,False,False,False,False,False,False,False,False,False
112,1,NaN,NaN,NaN,NaN,False,False,False,False,False,...,False,False,False,False,False,False,False,False,False,False
113,1,NaN,NaN,NaN,NaN,False,False,False,False,False,...,False,False,False,False,False,False,False,False,False,False
114,1,NaN,NaN,NaN,NaN,False,False,False,False,False,...,False,False,False,False,False,False,False,False,False,False

In [25]:
# Encoding a una columna especifica
df_encoding_column = pd.get_dummies(df_diamonds_encoding, columns=["world_champ"])
df_encoding_column

,name,victories,2nd,3rd,poles,fastest_lap,world_champ_1.0,world_champ_2.0,world_champ_3.0,world_champ_4.0,world_champ_5.0,world_champ_6.0,world_champ_7.0,world_champ_8.0
0,ROSSI Valentino,89,61.0,49.0,55.0,76,False,False,False,False,False,False,True,False
1,AGOSTINI Giacomo,68,20.0,NaN,6.0,69,False,False,False,False,False,False,False,True
2,MARQUEZ Marc,57,29.0,10.0,62.0,57,False,False,False,False,False,True,False,False
3,DOOHAN Mick,54,31.0,10.0,58.0,46,False,False,False,False,True,False,False,False
4,LORENZO Jorge,47,44.0,23.0,43.0,30,False,False,True,False,False,False,False,False
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
110,FRUTSCHI Michel,1,NaN,NaN,NaN,1,False,False,False,False,False,False,False,False
111,CZIHAK Edmund,1,NaN,NaN,NaN,1,False,False,False,False,False,False,False,False
112,COLNAGO Giuseppe,1,NaN,NaN,NaN,NaN,False,False,False,False,False,False,False,False
113,NaN,1,NaN,NaN,NaN,NaN,False,False,False,False,False,False,False,False
114,CARPENTER Phil,1,NaN,NaN,NaN,NaN,False,False,False,False,False,False,False,False

#### Uso de función map o apply

In [26]:
df = pd.read_csv('../Data/iris.csv')
df.head(2)

   Largo Sepalo  Ancho Sepalo  Largo Petalo  Ancho Petalo        Clase
0           5.1           3.5           1.4           0.2  Iris-setosa
1           4.9           3.0           1.4           0.2  Iris-setosa

In [27]:
df['Clase'].value_counts()

Clase
Iris-setosa        50
Iris-versicolor    50
Iris-virginica     50
Name: count, dtype: int64

In [28]:
num_clase = {
    'Iris-setosa': 1,
    'Iris-versicolor': 2,
    'Iris-virginica': 3
}

df['Clase'] = df['Clase'].map(num_clase)
df.head()

   Largo Sepalo  Ancho Sepalo  Largo Petalo  Ancho Petalo  Clase
0           5.1           3.5           1.4           0.2      1
1           4.9           3.0           1.4           0.2      1
2           4.7           3.2           1.3           0.2      1
3           4.6           3.1           1.5           0.2      1
4           5.0           3.6           1.4           0.2      1

#### Revisar pos si hay que quitar

In [29]:
# Correlacion
correlacion = df.corr()
correlacion

              Largo Sepalo  Ancho Sepalo  Largo Petalo  Ancho Petalo     Clase
Largo Sepalo      1.000000     -0.109369      0.871754      0.817954  0.782561
Ancho Sepalo     -0.109369      1.000000     -0.420516     -0.356544 -0.419446
Largo Petalo      0.871754     -0.420516      1.000000      0.962757  0.949043
Ancho Petalo      0.817954     -0.356544      0.962757      1.000000  0.956464
Clase             0.782561     -0.419446      0.949043      0.956464  1.000000

#### Ordenar por dos columnas con sort_values()

In [30]:
df_diamonds = pd.read_csv('../Data/motogp_allriders.csv')
df_diamonds.head()

               name  victories   2nd   3rd  poles fastest_lap  world_champ
0   ROSSI Valentino         89  61.0  49.0   55.0          76          7.0
1  AGOSTINI Giacomo         68  20.0   NaN    6.0          69          8.0
2      MARQUEZ Marc         57  29.0  10.0   62.0          57          6.0
3       DOOHAN Mick         54  31.0  10.0   58.0          46          5.0
4     LORENZO Jorge         47  44.0  23.0   43.0          30          3.0

In [31]:
# Ordenado por una columna
df_diamonds.sort_values("world_champ")

                  name  victories  2nd  3rd  poles fastest_lap  world_champ
69            MIR Joan          1  4.0  6.0    NaN           1          1.0
39     LIBERATI Libero          4  3.0  1.0    NaN           1          1.0
35       UNCINI Franco          5  1.0  5.0    1.0           1          1.0
33       GRAHAM Leslie          5  3.0  NaN    NaN           6          1.0
30   LUCCHINELLI Marco          6  7.0  6.0    9.0           9          1.0
..                 ...        ...  ...  ...    ...         ...          ...
110    FRUTSCHI Michel          1  NaN  NaN    NaN           1          NaN
111      CZIHAK Edmund          1  NaN  NaN    NaN           1          NaN
112   COLNAGO Giuseppe          1  NaN  NaN    NaN         NaN          NaN
113                NaN          1  NaN  NaN    NaN         NaN          NaN
114     CARPENTER Phil          1  NaN  NaN    NaN         NaN          NaN

[115 rows x 7 columns]

In [32]:
# Ordenado por 2 columnas
df_diamonds.sort_values(["world_champ", "victories"])

                name  victories   2nd   3rd  poles fastest_lap  world_champ
69          MIR Joan          1   4.0   6.0    NaN           1          1.0
44      HAYDEN Nicky          3   6.0  19.0    5.0           7          1.0
39   LIBERATI Libero          4   3.0   1.0    NaN           1          1.0
33     GRAHAM Leslie          5   3.0   NaN    NaN           6          1.0
35     UNCINI Franco          5   1.0   5.0    1.0           1          1.0
..               ...        ...   ...   ...    ...         ...          ...
24  VIÑALES Maverick          9   7.0  12.0   13.0          10          NaN
19        BIAGGI Max         13  26.0  19.0   23.0          14          NaN
20      MAMOLA Randy         13  22.0  19.0    5.0          12          NaN
17  DOVIZIOSO Andrea         15  21.0  26.0    7.0          11          NaN
7       PEDROSA Dani         31  40.0  41.0   31.0          44          NaN

[115 rows x 7 columns]

#### Agrupaciones con groupby y visualizarla

In [33]:
df_diamonds["name"].unique()

array(['ROSSI Valentino', 'AGOSTINI Giacomo', 'MARQUEZ Marc',
       'DOOHAN Mick', 'LORENZO Jorge', 'STONER Casey', 'HAILWOOD Mike',
       'PEDROSA Dani', 'LAWSON Eddie', 'SCHWANTZ Kevin', 'RAINEY Wayne',
       'ROBERTS Kenny', 'DUKE Geoff', 'SURTEES John', 'SPENCER Freddie',
       'SHEENE Barry', 'GARDNER Wayne', 'DOVIZIOSO Andrea',
       'CRIVILLE Alex', 'BIAGGI Max', 'MAMOLA Randy', 'READ Phil',
       'CAPIROSSI Loris', 'GIBERNAU Sete', 'VIÑALES Maverick',
       'CADALORA Luca', 'ROBERTS JR Kenny', 'HOCKING Gary', 'BARROS Alex',
       'QUARTARARO Fabio', 'LUCCHINELLI Marco', 'MASETTI Umberto',
       'MELANDRI Marco', 'GRAHAM Leslie', 'HARTOG Wil', 'UNCINI Franco',
       'OKADA Tadayuki', 'KOCINSKI John', 'ARMSTRONG Reg',
       'LIBERATI Libero', 'HARTLE John', 'FINDLAY Jack', 'BEATTIE Daryl',
       'PAGANI Alberto', 'HAYDEN Nicky', 'CRUTCHLOW Cal', 'RINS Alex',
       'HENNEN Pat', 'ABE Norick', 'MILANI Alfredo', 'CECOTTO Johnny',
       'MILLER Jack', 'OLIVEIRA Miguel', 'MCCOY Garry',
       'MORBIDELLI Franco', 'CHECA Carlos', 'FERRARI Virginio',
       'PETRUCCI Danilo', 'AMM Ray', 'PAGANI Nello', 'TAMADA Makoto',
       'MIDDELBURG Jack', 'ANDERSON Fergus', 'SAARINEN Jarno',
       'BINDER Brad', 'REDMAN Jim', 'VENTURI Remo', 'LANSIVUORI Teuvo',
       'MCINTYRE Bob', 'MIR Joan', 'KAVANAGH Ken', 'SHEPHERD Alan',
       'BERGAMONTI Angelo', 'SARRON Christian', 'KATAYAMA Takazumi',
       'VERMEULEN Chris', 'BONERA Gianfranco', 'DORAN William',
       'IANNONE Andrea', 'UKAWA Tohru', 'SPIES Ben', 'ELIAS Toni',
       'BRETT Jack', 'DALE Dickie', 'KANAYA Hideo', 'SIMMONDS Dave',
       'VAN DULMEN Boet', 'AHEARN Jack', 'NEWCOMBE Kim',
       'MONNERET Pierre', 'MORTIMER Chas', 'CRAFAR Simon',
       'CALDARELLA Benedicto', 'WILLIAMS John', 'CHILI Pierfrancesco',
       'NEWBOLD John', 'CREITH R.', 'KISSLING Jorge', 'PUIG Alberto',
       'BAYLISS Troy', 'STASTNY Franta', 'MARTIN Jorge', 'MAGEE Kevin',
       'HERRON Tom', 'LACONI Regis', 'GRANT Mike', 'LOMAS Bill',
       'NASH Godfrey', 'DANIELL Harold', 'MCCANDLESS Cromie',
       'FRUTSCHI Michel', 'CZIHAK Edmund', 'COLNAGO Giuseppe', nan,
       'CARPENTER Phil'], dtype=object)

In [34]:
df_diamonds.groupby(by = "name").max()

                  victories   2nd   3rd  poles fastest_lap  world_champ
name
ABE Norick                3   4.0  10.0    NaN           1          NaN
AGOSTINI Giacomo         68  20.0   NaN    6.0          69          8.0
AHEARN Jack               1   1.0   5.0    NaN         NaN          NaN
AMM Ray                   2   3.0   2.0    NaN           3          NaN
ANDERSON Fergus           2   1.0   NaN    NaN           2          NaN
...                     ...   ...   ...    ...         ...          ...
VAN DULMEN Boet           1   2.0   1.0    1.0         NaN          NaN
VENTURI Remo              1   9.0   1.0    NaN           2          NaN
VERMEULEN Chris           1   3.0   3.0    3.0           1          NaN
VIÑALES Maverick          9   7.0  12.0   13.0          10          NaN
WILLIAMS John             1   1.0   1.0    NaN           1          NaN

[114 rows x 6 columns]

In [36]:
df_diamonds.groupby(by = "name").aggregate(["min", "max"])

                 victories       2nd         3rd       poles        \
                       min max   min   max   min   max   min   max
name
ABE Norick               3   3   4.0   4.0  10.0  10.0   NaN   NaN
AGOSTINI Giacomo        68  68  20.0  20.0   NaN   NaN   6.0   6.0
AHEARN Jack              1   1   1.0   1.0   5.0   5.0   NaN   NaN
AMM Ray                  2   2   3.0   3.0   2.0   2.0   NaN   NaN
ANDERSON Fergus          2   2   1.0   1.0   NaN   NaN   NaN   NaN
...                    ...  ..   ...   ...   ...   ...   ...   ...
VAN DULMEN Boet          1   1   2.0   2.0   1.0   1.0   1.0   1.0
VENTURI Remo             1   1   9.0   9.0   1.0   1.0   NaN   NaN
VERMEULEN Chris          1   1   3.0   3.0   3.0   3.0   3.0   3.0
VIÑALES Maverick         9   9   7.0   7.0  12.0  12.0  13.0  13.0
WILLIAMS John            1   1   1.0   1.0   1.0   1.0   NaN   NaN

                 fastest_lap      world_champ
                         min  max         min  max
name
ABE Norick                 1    1         NaN  NaN
AGOSTINI Giacomo          69   69         8.0  8.0
AHEARN Jack              NaN  NaN         NaN  NaN
AMM Ray                    3    3         NaN  NaN
ANDERSON Fergus            2    2         NaN  NaN
...                      ...  ...         ...  ...
VAN DULMEN Boet          NaN  NaN         NaN  NaN
VENTURI Remo               2    2         NaN  NaN
VERMEULEN Chris            1    1         NaN  NaN
VIÑALES Maverick          10   10         NaN  NaN
WILLIAMS John              1    1         NaN  NaN

[114 rows x 12 columns]

##### Lo realizo tambien en el excel Canada ya que en el que yo he descargado son mumeros absolutos

In [40]:
df_canada = pd.read_excel("../Data/Canada.xlsx")
df.head(2)

,Tipo,Pais,Area,Continente,Region,Nombre de region,Tipo de region,1980,1981,1982,...,2004,2005,2006,2007,2008,2009,2010,2011,2012,2013
0,Immigrants,Afghanistan,935,Asia,5501,Southern Asia,Developing regions,16,39,39,...,2978,3436,3009,2652,2111,1746,1758,2203,2635,2004
1,Immigrants,Albania,908,Europe,925,Southern Europe,Developed regions,1,0,0,...,1450,1223,856,702,560,716,561,539,620,603

In [46]:
# Mostramos por cada continente el minimo de migrantes
df_canada.groupby(by = "Continente").min()

,Tipo,Pais,Area,Region,Nombre de region,Tipo de region,1980,1981,1982,1983,...,2004,2005,2006,2007,2008,2009,2010,2011,2012,2013
Continente,,,,,,,,,,,,,,,,,,,,,
Africa,Immigrants,Algeria,903,910,Eastern Africa,Developing regions,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
Asia,Immigrants,Afghanistan,935,906,Central Asia,Developed regions,0,0,0,0,...,1,0,0,2,1,5,4,3,1,1
Europe,Immigrants,Albania,908,923,Eastern Europe,Developed regions,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
Latin America and the Caribbean,Immigrants,Antigua and Barbuda,904,915,Caribbean,Developing regions,0,0,0,0,...,8,11,3,10,9,11,13,11,16,4
Northern America,Immigrants,Canada,905,905,Northern America,Developed regions,0,0,0,0,...,0,0,0,0,0,0,0,1,1,2
Oceania,Immigrants,American Samoa,909,927,Australia and New Zealand,Developed regions,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0

In [48]:
# Agregamos las columnas de minimo y maximo a DataFrame
df_canada.groupby(by = "Continente").aggregate(["min", "max"])

                                       Tipo                             Pais  \
                                        min         max                  min
Continente
Africa                           Immigrants  Immigrants              Algeria
Asia                             Immigrants  Immigrants          Afghanistan
Europe                           Immigrants  Immigrants              Albania
Latin America and the Caribbean  Immigrants  Immigrants  Antigua and Barbuda
Northern America                 Immigrants  Immigrants               Canada
Oceania                          Immigrants  Immigrants       American Samoa

                                                                                    \
                                                                               max
Continente
Africa                                                                    Zimbabwe
Asia                                                                         Yemen
Europe                           United Kingdom of Great Britain and Northern I...
Latin America and the Caribbean                 Venezuela (Bolivarian Republic of)
Northern America                                          United States of America
Oceania                                                                    Vanuatu

                                Area      Region        \
                                 min  max    min   max
Continente
Africa                           903  903    910   914
Asia                             935  935    906  5501
Europe                           908  908    923   926
Latin America and the Caribbean  904  904    915   931
Northern America                 905  905    905   905
Oceania                          909  909    927   957

                                          Nombre de region                    \
                                                       min               max
Continente
Africa                                      Eastern Africa    Western Africa
Asia                                          Central Asia      Western Asia
Europe                                      Eastern Europe    Western Europe
Latin America and the Caribbean                  Caribbean     South America
Northern America                          Northern America  Northern America
Oceania                          Australia and New Zealand         Polynesia

                                 ... 2009        2010        2011        2012  \
                                 ...  min    max  min    max  min    max  min
Continente                       ...
Africa                           ...    0   5532    0   6242    0   4663    0
Asia                             ...    5  29622    4  38617    3  36765    1
Europe                           ...    0   8876    0   8724    0   6204    0
Latin America and the Caribbean  ...   11   4652   13   5218   11   6503   16
Northern America                 ...    0   8995    0   8142    1   7676    1
Oceania                          ...    0   1018    0    933    0    851    0

                                       2013
                                   max  min    max
Continente
Africa                            5555    0   4331
Asia                             34315    1  34129
Europe                            6280    0   5827
Latin America and the Caribbean   5868    4   4152
Northern America                  7891    2   8501
Oceania                            982    0   1121

[6 rows x 80 columns]